# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'hashicorp/tap'
tap 'fluxcd/tap'

# System tools
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'screen'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'make'
brew 'file-formula'
brew 'less'
brew 'openssh'
brew 'unzip'
brew 'macvim'
brew 'gettext'
brew 'dive'
brew 'helm'

# Magic
brew 'go'
brew 'jq'
brew 'yarn'
brew 'node'
brew 'nvm'
brew 'kubectl'
brew 'kubectx'
brew 'azure-cli'
brew 'htop'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'velero'
brew 'bfg'
brew 'stern'
brew 'circleci'
brew 'fluxcd/tap/flux'

# Casks
cask 'iterm2'
cask 'visual-studio-code'
cask 'docker'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'dotnet-sdk'
cask 'discord'
cask 'ngrok'
