# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'hashicorp/tap'
tap 'fluxcd/tap'

# System tools
brew 'bash-completion'
brew 'bash'
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'dive'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gettext'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'helm'
brew 'just'
brew 'less'
brew 'macvim'
brew 'make'
brew 'openssh'
brew 'unzip'
brew 'watch'
brew 'wget'

# Magic
brew 'azure-cli'
brew 'bfg'
brew 'btop'
brew 'cloc'
brew 'cmatrix'
brew 'dos2unix'
brew 'fastfetch'
brew 'fluxcd/tap/flux'
brew 'go'
brew 'goreleaser'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'htop'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'nvm'
brew 'stern'
brew 'velero'
brew 'yq'

# Casks
cask 'docker'
cask 'domzilla-caffeine'
cask 'font-monaspace'
cask 'ghostty'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'ngrok'
cask 'tiles'
cask 'visual-studio-code'
