# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'

# System tools
brew 'bash'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'screen'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'make'
brew 'file-formula'
brew 'less'
brew 'openssh'
brew 'rsync'
brew 'unzip'
brew 'macvim'
brew 'gettext'

# Magic
brew 'git'
brew 'go'
brew 'docker'
brew 'docker-compose'
brew 'python'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'azure-cli'
brew 'htop'
brew 'terraform'
brew 'velero'
brew 'bfg'
brew 'stern'
brew 'circleci'

# Casks
cask 'iterm2'
cask 'visual-studio-code'
cask 'docker'
cask 'docker-toolbox'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'powershell'
cask 'slack'
cask 'google-chrome'
cask 'dotnet-sdk'
# cask 'adoptopenjdk --no-quarantine'
